Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: སྙམ་དུ་སེམས་མོད་ཀྱི། སེམས་ཅན་མེད་དུ་ཟིན་ཀྱང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་མངོན་ནོ་
en: However, while indeed no beings exist, the ripening of karma does manifest!’

source: སྙམ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཇི་ལྟར་སེམས་ཅན་དེ་ཡང་མེད་ལ། ཇི་ལྟར་དགེ་བ་དང་། མི་དགེ་བའི་ལས་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་མངོན་པ་དེ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Thus, with this insight, bodhisattvas understand correctly that, although sentient beings do not exist, the ripening of virtuous and unvirtuous karma nevertheless does manifest.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise concerning the ripening of karma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འདུས་བྱས་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise concerning the conditioned consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་རྟོག་པར་བྱེད་ཅིང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: With genuine insight bodhisattvas consider conditioned phenomena in the following way:

source: འདུས་བྱས་ཀྱི་ཆོས་འདི་དག་ནི་མི་གནས་པ།
en: ‘These conditioned phenomena know no remaining.

source: གཡོ་བ། ཟིལ་པའི་ཐིགས་པ་ལྟ་བུ། རི་བོའི་འབབ་ཆུ་ལྟ་བུ་ཡིན་ན།
en: They are in motion, resembling dewdrops and a waterfall in the mountains.

source: དེ་ལ་མཁས་པ་སུ་ཞིག་འདི་ལྟ་བུའི་ཆོས་རྣམས་ལ་ཞེན་པ་དང་། ཆགས་པར་བྱེད་པའམ། དེ་དག་མེད་པར་གྱུར་པས་མྱ་ངན་དུ་བྱེད་སྙམ་ནས།
en: What knowledgeable person would develop attachment to them, or desire them, or be pained by their disappearance?’

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་སྐྱོབ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། འགོག་པ་ལ་སེམས་གཏོང་སྟེ།
en: Thus, due to such causes, conditions, and bases, they develop weariness, free themselves from desire, and turn their minds toward cessation.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འདུས་བྱས་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise concerning the conditioned.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་རྒྱུན་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise concerning the continuity of cyclic existence consist in?

source: ཀྱེ་མའོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་མ་རིག་པས་ལྡོངས་པ།
en: ‘Alas, those dwelling within cyclic existence are blinded by ignorance.

source: འཁོར་བ་ལ་ཕྱོགས་པ། སྲིད་པའི་ཞགས་པས་བཅིངས་པ་སྟེ། ལེན་པ་ཉེ་བར་ལེན་ཏོ།
en: Attracted to cyclic existence, they are bound by the chains of existence and so they continue appropriating further existence.

source: དེ་ལེན་པའི་རྒྱུས་དགེ་བ་དང་། མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་དེ། དེ་དགེ་བ་དང་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དང་ལྡན་པས་སྲིད་པར་ཡང་མཚམས་སྦྱོར་བར་འགྱུར་ཏེ།
en: Because of this appropriation they engage in virtuous and unvirtuous actions and with the formation of virtuous and unvirtuous karmic actions they go from one existence to another.

source: དེའི་རྒྱུ་ལས་སྐྱེ་བར་འགྱུར་རོ།
en: Due to this, they take birth.

source: སྐྱེ་བ་ཡོད་པས་རྒ་བར་འགྱུར་རོ། །རྒ་བའི་ཆོས་ཅན་ནི་འཆི་བར་འགྱུར་རོ།
en: Once born, they also have to age and die,

source: འཆི་བ་ལས་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྒྱུན་ཆགས་པ་ཉིད་དུ་འགྱུར་ཏེ།
en: with death follows endless pain, lamentation, suffering, and distress, as well as ceaseless turmoil.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་དེ་ཟོ་ཆུན་རྒྱུད་མོའི་འཁོར་ལོ་ལྟར།
en: Thus emerges this great mass of nothing but suffering.

source: འཁོར་བའི་འཁོར་ལོའི་རྒྱུན་དུ་འགྱུར་རོ་སྙམ་སྟེ།
en: Like a turning waterwheel, the wheel of existence continues to spin in this way.’

source: དེ་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: This bodhisattvas recognize by the power of genuine insight.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་རྒྱུན་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise with regard to the continuity of cyclic existence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ལྡོག་པ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise with respect to the reversal of cyclic existence consist in?

source: མ་རིག་པ་མེད་པར་གྱུར་པས་འདུ་བྱེད་ལ་ཞེན་པར་མི་འགྱུར། འདུ་བྱེད་ལ་ཞེན་པ་མེད་པར་གྱུར་པས་རྣམ་པར་ཤེས་པར་མི་འགྱུར།
en: ‘Once ignorance has disappeared there will no longer be any attachment to formation, and without such attachment there will be no consciousness.

source: རྣམ་པར་ཤེས་པ་མེད་པར་གྱུར་པས་མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་མེད་པར་འགྱུར་རོ།
en: When there is no consciousness there can be no name and form, nor the six sense sources, nor contact, nor feeling, nor any craving either.

source: སྲེད་པ་མེད་པར་གྱུར་པས་ལེན་པ་མི་འབྱུང་སྟེ། ལེན་པ་མེད་པས་སྲིད་པ་ཡང་མཚམས་སྦྱོར་བར་མི་འགྱུར།
en: When there is no craving, there cannot be grasping, and when there is no grasping there is no connection to a future existence.

source: སྲིད་པ་ཡང་མཚམས་སྦྱོར་བ་མེད་པར་གྱུར་པས། སྐྱེ་བར་མི་འགྱུར།
en: Without such future existence there will not be any birth,

source: སྐྱེ་བ་མེད་པར་གྱུར་པས་རྒ་ཤི་དང་།
en: in the absence of birth there cannot be any old age and death.

source: མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: pain, lamentation, suffering, distress, and turmoil will all come to an end.’

source: དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ས་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Bodhisattvas recognize this by the power of genuine insight.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ལྡོག་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise with regard to the reversal of cyclic existence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise with respect to the vehicles of the hearers and solitary buddhas consist in?

source: ཆོས་འདིས་ནི་རྒྱུན་དུ་ཞུགས་པར་འགྱུར་རོ། །འདིས་ནི་ལན་ཅིག་ཕྱིར་འོང་བར་འགྱུར་རོ། །འདིས་ནི་ཕྱིར་མི་འོང་བར་འགྱུར། འདིས་ནི་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ།
en: Bodhisattvas comprehend exactly which teachings lead to the attainments of a stream enterer, a once-returner, a non-returner, and a worthy one who has exhausted defilement.

source: སྲིད་པའི་ཀུན་ཏུ་སྦྱོར་བ་ཆད་པ། ཡང་མཚམས་སྦྱོར་བ་མེད་པ། མྱ་ངན་ལས་འདས་པ་ལ་ཡང་དག་པར་གཞོལ་བར་འགྱུར་རོ།
en: They know which teachings sever the ties of existence, dissolve the processes of continued existence, and truly deliver the transcendence of suffering.

source: ཆོས་འདིས་ནི་རང་སངས་རྒྱས་བསེ་རུ་ལྟ་བུར་གཅིག་པུ་སྤྱོད་པར་འགྱུར་རོ་སྙམ་སྟེ།
en: Likewise, they know exactly which teachings lead to the attainment of a single rhinoceros-like solitary buddha.

source: དེ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་རབ་ཏུ་རྟོགས་པར་བྱེད་དེ།
en: All this bodhisattvas comprehend by the power of genuine insight.

source: ཆོས་འདི་དག་མངོན་དུ་ཡང་མི་བྱེད་དོ།
en: Yet they do not actualize any of those attainments.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Why? Because they think as follows:

source: སེམས་ཅན་གྱི་ཁམས་བདག་གིས་བཟུང་། བདག་གིས་སེང་གེའི་སྒྲ་བསྒྲགས་ཏེ།
en: ‘The realms of sentient beings are my responsibility. I have roared like a lion,

source: སེམས་ཅན་འཁོར་བའི་འབྲོག་དགོན་པ་ན་གནས་པ་ཐམས་ཅད་སྒྲོལ་ལོ་ཞེས་དམ་བཅས་ལ།
en: promising to liberate all beings who are confined to the wilds of cyclic existence.

source: གཅིག་པུ་འཁོར་བའི་འབྲོག་དགོན་པ་ནས་འབྱུང་བ་ནི་བདག་གི་མི་ཆའོ་སྙམ་སྟེ།
en: It would not be right of me to escape from that wilderness alone.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise with respect to the vehicles of the hearers and solitary buddhas.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ཆེན་པོ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise with respect to the Great Vehicle consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བསླབ་པ་ཐམས་ཅད་ལ་ཡང་སློབ་ལ།
en: Bodhisattvas pursue all the aspects of their training,

source: སློབ་པ་ཡང་མི་དམིགས། བསླབ་པའི་ལམ་ཡང་མི་དམིགས། གང་སློབ་པ་དེ་ཡང་མི་དམིགས་སོ།
en: they do not reify these trainings, nor do they reify any path to train upon, nor anyone who trains.

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ཆད་པར་ལྟ་བར་ཡང་མི་ལྟུང་སྟེ།
en: By such causes, conditions, and bases they do not fall into a view of annihilation.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ཆེན་པོ་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise with respect to the Great Vehicle.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ལས་སྤོང་བ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise in giving up the activities of the māras consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་མི་དགེ་བའི་གྲོགས་པོ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་སྟེ།
en: Bodhisattvas give up unvirtuous company in all regards.

source: མི་ཆ་བའི་ཡུལ་ལ་གནས་པ་དང་། འཇིག་རྟེན་རྒྱང་པན་པའི་གསང་ཚིག་ལ་སྟེན་ཅིང་སྒོམ་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་དང་། མཆོད་པ་དང་། རིམ་གྲོ་ལ་ཆེད་ཆེར་འཛིན་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ངོ་།
en: Thus they stay clear of those who live in inappropriate places, those who rely on and cultivate the spells of the Lokāyatas, and those who cherish gain, honor, worship, and veneration.

source: ཉེ་བའི་ཉོན་མོངས་པ་གཞན་གང་བྱང་ཆུབ་ཀྱི་ལམ་གྱི་བར་ཆད་དུ་འགྱུར་བ་དེ་དག་ཀྱང་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ཞིང་། དེ་དག་གི་གཉེན་པོ་ལ་ཡང་སྟེན་ཏེ།
en: They also entirely give up the subsidiary afflictions that are obstacles on the path to awakening and instead they apply their remedies.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ལས་ཡོངས་སུ་སྤང་བ་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise in giving up the activities of the māras.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མ་ལོག་པའི་ཤེས་རབ་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise in terms of unmistaken insight consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་པའི་གཙུག་ལག་དང་། གསང་ཚིག་དང་། ལས་དང་། བཟོའི་གནས་ཐམས་ཅད་ལ་ཤེས་རབ་གཏོང་སྟེ།
en: Bodhisattvas direct their insight toward the mundane treatises, spells, and the field of craftmanship and the arts.

source: དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཏེ། ཤེས་ཀྱི་ཁེ་འདོད་པ་དང་། གྲགས་པ་འདོད་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་འདོད་པའི་ཕྱིར་མ་ཡིན་གྱི།
en: However, they do so for the sake of maturing sentient beings, and not out of a concern for profit, fame, wealth, or respect.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པའི་ཆེ་བ་ཉིད་བརྗོད་པའི་ཕྱིར་ཏེ། དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བའི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: They aim to thereby express the greatness of the Thus-Gone One’s teaching, and so their involvement is not due to a perception of desirable qualities within those fields.

source: གཞན་དུ་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གསུང་རབ་འདི་ནི་དམ་པ་སྟེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཆོས་འདུལ་བའོ་སྙམ་ནས།
en: Moreover, they think to themselves, ‘The sacred teaching is the Dharma-Vinaya of the Thus-Gone One.’

source: དེ་དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བས་མུ་སྟེགས་ཅན་གཞན་གྱི་ལྟ་བ་ཅན་དུ་མི་འགྱུར་ཏེ།
en: Since they appreciate its good qualities in that way, they do not adopt the views of any non-Buddhists.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མ་ལོག་པའི་ཤེས་རབ་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise in terms of unmistaken insight.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པ་མེད་པའི་ཤེས་རབ་ཅན་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ expertise with respect to unequaled insight.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། སྐྱེ་དགུའི་དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པ། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་ནང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་གཏོགས་པར་གང་དེ་དང་ཤེས་རབ་མཉམ་པ་དེ་ལྟ་བུའི་སེམས་ཅན་སེམས་ཅན་གྱི་རིས་ན་མེད་དེ།
en: Noble son, bodhisattvas are aware that within the world of gods, humans, and demigods, including Māra, Brahmā, and all the gods, mendicants, and brahmins, there is no one whose insight matches that of the thus-gone, worthy, perfect buddha.

source: དེ་ནི་འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། སྐྱེ་དགུའི་དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པ། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་ནང་ན། ཤེས་རབ་ཀྱི་བྱེ་བྲག་གིས་ཟིལ་གྱིས་མནན་པ་ཡིན་ཏེ།
en: With his special insight, he outshines the entire world of gods, humans, and demigods, including Māra, Brahmā, and all the gods, mendicants, and brahmins.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པ་མེད་པའི་ཤེས་རབ་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ expertise with respect to unequaled insight.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities are endowed with excellent insight.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent skill in means possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡོངས་སུ་བསྔོ་བའི་ཐབས་མཁས་པ་རྣམས་ཡིན། མུ་སྟེགས་ཅན་རྣམ་པར་ཟློག་པའི་ཐབས་མཁས་པ་རྣམས་ཡིན། ཡུལ་ལས་རྣམ་པར་ཟློག་པའི་ཐབས་མཁས་པ་རྣམས་ཡིན། འགྱོད་པ་ཡིད་ལ་གཅགས་པ་སེལ་བའི་ཐབས་མཁས་པ་རྣམས་ཡིན། སེམས་ཅན་ལ་དཔུང་གཉེན་བྱེད་པའི་ཐབས་མཁས་པ་རྣམས་ཡིན། སེམས་ཅན་འཚོ་བའི་ཐབས་ཉེ་བར་སྦྱོར་བ་ལ་མཁས་པ་རྣམས་ཡིན། ལེན་པའི་ཐབས་མཁས་པ་རྣམས་ཡིན། གནས་ནས་གནས་སུ་སློང་བའི་ཐབས་མཁས་པ་རྣམས་ཡིན། ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། གཟེངས་སྟོད་པ་དང་། ཤིན་ཏུ་དགའ་བར་བྱེད་པའི་ཐབས་མཁས་པ་རྣམས་ཡིན། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བའི་ཐབས་མཁས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are skill in dedication, skill in converting non-Buddhists, skill in making others withdraw from objects, skill in dispelling lingering regrets, skill in being a protector of sentient beings, skill in providing sentient beings with a livelihood, skill in accepting, skill in delivering sentient beings from one context to another, skill in genuinely encouraging, inspiring, and exhilarating beings, and skill in worshiping and venerating the Thus-Gone One.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བསྔོ་བའི་ཐབས་མཁས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ skill in dedication.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་དག་མེ་ཏོག་གི་རྣམ་པའམ། འབྲས་བུའི་རྣམ་པ་ང་ཡིར་བྱ་བ་མེད་པ། ཡོངས་སུ་བཟུང་བ་མེད་པ་
en: Noble son, without any sense of personal ownership, bodhisattvas offer various forms of flowers and fruits

source: དེ་རྣམས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འབུལ་ལོ།
en: to the buddhas and bodhisattvas three times during the day and three times at night,

source: དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: all the roots of virtue they dedicate toward the attainment of unexcelled and complete awakening.

source: དེ་གང་འདི་དག་བདུག་པའི་ཤིང་ངམ། སྤོས་ཀྱི་ཤིང་ངམ། རིན་པོ་ཆེའི་ཤིང་ངམ། དཔག་བསམ་གྱི་ཤིང་ངམ། མེ་ཏོག་གི་ཤིང་ངམ། འབྲས་བུའི་ཤིང་ང་ཡིར་བྱ་བ་མེད་པ་ཡོངས་སུ་བཟུང་བ་མེད་པ་དེ་དག་ཀྱང་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འབུལ་ལོ།
en: Trees of perfume, trees of incense, jewel trees, wish-fulfilling trees, flowering trees, and fruit-bearing trees they offer without any sense of ownership or possession three times during the day and three times at night to the buddhas and bodhisattvas,

source: དེ་མདོ་སྡེ་རྣམས་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བ་གང་འདི་དག་རྒྱ་ཆེན་པོ་རྒྱ་ཆེ་བ་དག་ཉན་ཅིང་
en: They listen extensively to the vast discourses that are to be worshiped and venerated,

source: དེ་དག་སྙིང་ཐག་པ་ནས་ལྷག་པའི་བསམ་པ་མཆོག་གིས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡོངས་སུ་བསྔོའོ།
en: from the bottom of their hearts they dedicate their studies to the buddhas and bodhisattvas with a supreme and superior intent.

source: གང་ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་དག་དགེ་བའི་ལས་རྣམས་བྱེད་ཅིང་བྱང་ཆུབ་ཀྱི་ཚོགས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་ལ་སྙིང་ཐག་པ་ནས་རྗེས་སུ་ཡི་རང་སྟེ།
en: From the bottom of their hearts they rejoice in any virtuous act or practice that serves to complete the accumulations for awakening whenever such acts and practices are carried out by bodhisattvas or other beings throughout the ten directions.

source: དེ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ནམ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་ལ་མེ་ཏོག་གམ། བདུག་པའམ། སྤོས་གསོལ་ན་
en: Shrines devoted to the thus-gone ones and statues of the thus-gone ones they worship with flowers, perfumes, and incense.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངང་ཚུལ་ངན་པའི་དྲི་ང་བ་བསལ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་ཐོབ་པར་ཡོངས་སུ་བསྔོའོ།
en: they dedicate this practice so that sentient beings may be free of the foul smell of their base character and achieve the fragrance of the thus-gone ones’ discipline.

source: དེ་ཕྱག་དར་དང་ཞལ་ཞལ་བྱེད་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་མི་སྡུག་པ་མེད་པར་འགྱུར་བ་དང་། སྤྱོད་ལམ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པར་ཡོངས་སུ་བསྔོའོ།
en: When they sweep and repair such sacred objects they dedicate their work so that sentient beings may be free from repulsive behavior and instead take up beautiful and excellent activities.

source: དེ་མེ་ཏོག་གི་གདུགས་གསོལ་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པའི་གདུང་བ་མེད་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོའོ།
en: As they offer flower parasols they do so with the dedication that sentient beings may be free from the torments of the primary and subsidiary afflictions.

source: དེ་གཙུག་ལག་ཁང་གི་ནང་དུ་འགྲོ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་གཟུད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་དོ།
en: When they enter a temple, they develop the motivation, ‘I shall deliver all beings to the city of the transcendence of suffering.’

source: དེ་ཕྱིར་འབྱུང་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་བཙོན་ར་ནས་འདོན་ཏོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they go outside, they develop the motivation, ‘I shall free all beings from the prison of cyclic existence.’

source: དེ་གནས་ཁང་གི་སྒོ་འབྱེད་ན་འདི་ལྟར་འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཀྱིས་བདེ་འགྲོ་ཐམས་ཅད་ཀྱི་སྒོ་དབྱེའོ། །སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they open the door to their home they form the motivation, ‘I shall open the doors to the joyful destinations with the wisdom that transcends the world.’

source: དེ་སྒོ་གཅོད་ན་འདི་ལྟར་ངན་འགྲོ་ཐམས་ཅད་ཀྱི་སྒོ་རྣམས་གཅད་དོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they close the door, they develop the motivation, ‘I shall close the doors to the lower realms.’

source: དེ་འདུག་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་དགོད་དོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they rest, they form the wish, ‘I shall place all beings at the seat of awakening.’

source: དེ་གློ་གཡས་པས་ཉལ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they lie down to sleep on their right side they think, ‘I shall bring all beings beyond suffering by means of the buddhas’ transcendence of suffering.’

source: དེ་དེ་ནས་ལྡང་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཉོན་མོངས་པའི་ཀུན་ནས་ལྡང་བ་རྣམས་ལས་བསླང་ངོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: As they get up, they develop the motivation, ‘I shall cause all beings to rise above the occurrence of affliction.’

source: དེ་ལུས་ཀྱི་ཆེད་ལ་འགྲོ་ན། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སྐྱེས་བུ་ཆེན་པོའི་འགྲོས་སུ་འགྲོ་བར་གྱུར་ཅིག་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: In terms of the body, when they walk, they think, ‘May all beings walk with the gait of a great being.’

source: དེ་དེར་འདུག་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཟུག་རྔུ་དབྱུང་ངོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they sit, they do so with the motivation, ‘May all beings be relieved of the pains of desire, anger, and dullness.’

source: དེ་བཀྲུ་བཤལ་བྱེད་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་དྲི་མའི་སྐྱོན་རྣམས་བཀྲུའོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they take a bath they develop the motivation, ‘I shall wash away all beings’ stains of affliction.’

source: དེ་ལག་པ་བསྙལ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་དྲི་ང་བ་རྣམས་བསལ་ལོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they wash their hands they think, ‘I shall clear away the stench of affliction for all beings.’

source: དེ་རྐང་པ་འཁྲུ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་རྡུལ་རྣམ་པ་སྣ་ཚོགས་བསལ་ལོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: When they wash their feet their motivation is, ‘I shall wash away all the dust of affliction for all beings.’

source: དེ་སོ་ཤིང་ཟ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དྲི་མ་རྣམ་པ་སྣ་ཚོགས་བསལ་ལོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: As they brush their teeth they think, ‘I shall dispel all the various stains of sentient beings.’

source: དེ་ལུས་ཀྱི་གཡོ་བ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བར་ཡོངས་སུ་སྔོའོ།
en: All physical movements they dedicate to the benefit and happiness of all beings.

source: དེ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བྱ་བར་ཤོག་ཤིག་སྙམ་དུ་སེམས་སྐྱེད་དེ།
en: When they prostrate before shrines devoted to the thus-gone ones they think, ‘May all beings of the world, including the gods, come to worship.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྔོ་བའི་ཐབས་མཁས་པ་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ skill in dedication.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མུ་སྟེགས་ཅན་རྣམ་པར་ཟློག་པའི་ཐབས་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ skill in converting non-Buddhists consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་སྟེ། མུ་སྟེགས་ཅན་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་ལ་སོགས་པའི་མུ་སྟེགས་ཅན་གྱི་གནས་དེ་དང་དེ་དག་ཏུ་འཕྲུལ་བ་དག་མངོན་པར་སྤྲུལ་ཏེ།
en: For that, bodhisattvas project emanations at the sites where there are non-Buddhists such as the carakas, the parivrājakas, and the nirgranthas.

source: དེ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐབས་བྱེད་ཅིང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Attempting to mature them, bodhisattvas think,

source: ཀྱེ་མའོ་སེམས་ཅན་འདི་རྣམས་ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པས་
en: ‘Alas, these beings have been taken by pride.

source: བདག་གིས་སྔར་སློབ་དཔོན་གྱི་ཚུལ་གྱིས་གདུལ་བར་ནི་མི་ནུས་ཀྱིས། སློབ་མར་ཁས་བླང་ངོ་སྙམ་སྟེ།
en: In the past I was unable to train them as their master, so now I shall accept to be their disciple.’

source: དེ་དག་གི་ཁྲོད་དུ་རབ་ཏུ་འབྱུང་ངོ་།
en: So they take ordination among them.

source: དེ་རབ་ཏུ་བྱུང་ནས་ཇི་ལྟར་སྤྱོད་པ་དང་། སྤྱོད་ཡུལ་དང་། མང་དུ་ཐོས་པ་དང་། སྤྱོད་པ་དམན་ཚེགས་ཀྱིས་ཀྱང་མུ་སྟེགས་ཅན་གཞན་དེ་དག་ཟིལ་གྱིས་གནོན་པ་དེ་ལྟ་དེ་ལྟ་བུར་རྩོལ་ལོ། །འབད་དོ། །བརྩོན་འགྲུས་རྩོམ་མོ།
en: Once ordained, they strive, persist, and muster diligence so as to outshine other non-Buddhists in terms of their activities, pursuits, scholarship, and austerities.

source: དེ་དག་གི་ནང་ན་སློབ་དཔོན་དང་བླ་མ་ལྟ་བུར་བཀུར་བར་འགྱུར། ཚིག་བཟུང་ཞིང་ངག་མི་གཅོག་པར་འགྱུར་ཏེ།
en: In this way they end up being venerated as teachers and masters among the non-Buddhists and their words are kept in mind and adhered to.

source: ཀྱེ་སེམས་ཅན་དེ་དག་ཉེ་བར་གྱུར་པའོ་སྙམ་དུ་ཤེས་ནས།
en: When the bodhisattvas then feel that the non-Buddhists have become close students, they declare,

source: གྲོགས་པོ་དག་འདི་ནི་སྐྱོ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། འགོག་པར་འགྱུར་བའི་ལམ་མ་ཡིན་ནོ་ཞེས་
en: ‘Friends, this is not the path of weariness, freedom from desire, and cessation!’

source: མུ་སྟེགས་ཅན་དེ་དག་གི་མ་ལེགས་པ་རྗོད་པར་འགྱུར་ཏེ། དེས་མུ་སྟེགས་ཅན་གཞན་དེ་དག་གནས་དེ་རྣམས་ལས་བསླང་ནས་དེ་བཞིན་གཤེགས་པའི་ཆོས་འདུལ་བ་ལ་འགོད་དོ།
en: Having declared the shortcomings of the non-Buddhists, bodhisattvas then inspire them to leave those communities, and establish them in the Dharma-Vinaya of the thus-gone ones.

source: དེ་ཕྱི་རོལ་གྱི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དག་གི་གན་དུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་དོ།
en: “Bodhisattvas will likewise practice pure conduct near non-Buddhists who possess the five superknowledges.

source: དེ་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིང་ཆོས་དེ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ཅིང་རྩོལ་ལོ། །འབད་དོ།
en: Practicing such conduct, they will seek to obtain that teaching, and so they will strive and persist.

source: དེ་རྩོལ་ཞིང་འབད་པས་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་སྒྲུབ་སྟེ།
en: With such persistence, they accomplish the concentrations, absorptions, and attainments.

source: ཅི་ནས་ཀྱང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་གཞན་དེ་དག་པས་ཆེས་མཆོག་ཏུ་འགྱུར་བ་དང་།
en: As they ardently seek to obtain the five superknowledges they become vastly superior to those around them.

source: ཆེས་འབར་བར་འགྱུར་བ་དང་། སློབ་དཔོན་གྱི་མཆོག་ཏུ་འགྱུར་བ་དང་། མཁས་པར་བཀུར་བར་འགྱུར་བ་དེ་ལྟར་སྒྲུབ་བོ།
en: Much more splendid than the rest, they emerge as supreme masters who are venerated because of their expertise.
